<?php

return [
    'cookie_name' => 'alnahda_quiz_records',
    'cookie_expiration' => 365 * 24 * 60, // minutes
    'quizzes' => [
        [
            'id' => 1,
            'questions' => [
                [
                    'id' => 1,
                    'text_ar' => 'إذا كنت  تنوي أن تستثمر في واحدة من هذه الشركات الناشئة، أي واحدة ستختار؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'تطبيق يعنى بخدمات التجميل يملكه رائد أعمال',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'تطبيق يعنى بالاستثمار تملكه رائدة أعمال',
                            'weight' => 2,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'أحتاج تقارير تفصيلية لكلتا الشركتين قبل اتخاذ القرار',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 2,
                    'text_ar' => 'أنت تعمل في أحد البنوك وتحتاج إلى اختيار المرشحين المناسبين لمنحهم قرضًا تجاريًا.  من تختار؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'رجل أعمال يريد فتح أفرع جديدة لسلسلة من البقالة يملكها',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'سيدة أعمال تريد فتح أفرع جديدة لسلسلة من البقالة تملكها',
                            'weight' => 1,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'لا يمكنني اتخاذ القرار ما لم يكن لدي إحصاءات وتقارير عن الشركتين',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 3,
                    'text_ar' => 'من برأيك يجب أن يتحمّل مسؤولية ميزانية المنزل؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'الرجل حتى تتمكن المرأة من رعاية الأسرة',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'يجب على من يعيل الأسرة اتخاذ القرارات المالية',
                            'weight' => 2,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'يجب أن يتعاون كلاهما معاً في هذه المهمّة',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 4,
                    'text_ar' => 'تتصل بك إدارة المدرسة لابنتك لأنهم يريدون ترشيحها لفريق كرة القدم الوطني للسيدات. ماذا سيكون ردّك؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'أفضّل أن لا تشارك ابنتي في مباريات محترفة',
                            'weight' => 2,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'أنا فخور بها وإذا كان شيئًا تستمتع به، سأدعمها',
                            'weight' => 3,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'الرياضة ليست المسار الصحيح للفتيات',
                            'weight' => 1,
                        ],
                    ],
                ],
                [
                    'id' => 5,
                    'text_ar' => 'اشتريت منزل جديد وتريد تصميم الديكور، مع من تعمل؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'مصممة ديكور سيدة لأنها أكثر إلمامًا بشؤون المنزل',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'مصمم ديكور  رجل لأنه أكثر احترافية',
                            'weight' => 1,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'اختار المصمم/ة بحسب الكفاءة والخبرة',
                            'weight' => 3,
                        ],
                    ],
                ],
            ],
        ],
        [
            'id' => 2,
            'questions' => [
                [
                    'id' => 1,
                    'text_ar' => 'أتيحت لك فرصة الاستثمار في شركة  واعدة تملكها سيدة. هل ستمضي قدمًا في هذه الفرصة؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'كلا، أتردد لأن السيدات ليس لديهن الخبرة اللازمة لتنمية الأعمال التجارية',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'ممكن، لكن أراقبهم عن كثب',
                            'weight' => 2,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'لم لا, طالما الشركة واعدة ',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 2,
                    'text_ar' => 'أنت ذاهب إلى البنك للحصول على استشارة مالية. اكتشفت أن الاستشاري سيدة، ماذا تفعل؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'أطلب تغيير الموظف إلى رجل',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'استمر في جلسة الاستشارة',
                            'weight' => 3,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'سأحاول الحصول على رأي ثان من محترف آخر',
                            'weight' => 2,
                        ],
                    ],
                ],
                [
                    'id' => 3,
                    'text_ar' => 'عند توزيع الميراث هل تؤيد:',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'إعطاء المرأة حقها بالميراث بغض النظر عن المسؤوليات لأنه حق شرعي',
                            'weight' => 3,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'لا حاجة لها بالميراث لأن مسؤوليات الرجل أكبر وأهم',
                            'weight' => 1,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'تعطيها الميراث لكنها لا تستطيع التصرف به دون اللجوء إلى وكيل',
                            'weight' => 2,
                        ],
                    ],
                ],
                [
                    'id' => 4,
                    'text_ar' => 'يعود ابنك إلى المنزل مستاء لأنه تعرض للتنمر في المدرسة ، كيف ستتعامل معه؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'على الأم أن تتعامل معه، فهي المسؤولة عن الرعاية وإحتواء الإبن',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'على الأب أن يتعامل معه ، لأنه يحتاج إلى تعليم ابنه كيف يكون قويًا ويدافع عن نفسه من دون البكاء',
                            'weight' => 2,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'يجب على كل من الأم والأب التعامل مع هذا الأمر ، حيث أن الأبوة والأمومة المشتركة هي السبيل الأنسب',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 5,
                    'text_ar' => 'أنت مدير الموارد البشرية ، وعليك أن تعين موظف لمنصب مهم. من تختار؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'مرشحة كفؤة وتملك المهارات ولكنها حامل',
                            'weight' => 3,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'مرشح أقل كفاءة ولكنه أعزب وقادر على التفاني الكامل',
                            'weight' => 1,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'لا أختار أي أحد منهم، واستمر في البحث عن مرشحين آخرين',
                            'weight' => 2,
                        ],
                    ],
                ],
            ],
        ],
        [
            'id' => 3,
            'questions' => [
                [
                    'id' => 1,
                    'text_ar' => 'أنت تبني تطبيقًا خاصًا بشركة أغذية الأطفال، من هو برأيك الأجدر بالثقة في البرمجة؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'رجل مبرمج, عادة ما يتفوق الرجال في تطوير البرمجيات',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'امرأة مبرمجة, النساء يعرفن ميدان أغذية الأطفال أفضل من الرجال',
                            'weight' => 1,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'قرارك يعتمد على من لديه سنوات أطول  في مجال البرمجة',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 2,
                    'text_ar' => 'برأيك، مَنْ على الأرجح  قادر على تسديد قرض مصرفي في وقته المحدّد؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'الرجال',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'السيدات',
                            'weight' => 1,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'لا فرق',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 3,
                    'text_ar' => 'ما رأيك بتقسيم الأعمال المنزلية بين الزوجين مثل: تنظيف المنزل والاهتمام بالأطفال؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'يجب على المرأة أن تهتم بكل ما يتعلق  بالمنزل حتى يتمكن الرجل من إعالة الأسرة',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'لما لا، يجب تقسيم الأعمال المنزلية بين جميع أفراد المنزل',
                            'weight' => 3,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'هناك بعض الأدوار التي يجب احترامها في العائلة',
                            'weight' => 2,
                        ],
                    ],
                ],
                [
                    'id' => 4,
                    'text_ar' => 'قررت زميلتك أنها تريد مواصلة تعليمها عبر الإنترنت. لديها طفلان وزوج يعمل بدوام كامل. ماذا تقول لها؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => 'الآن ليس الوقت المناسب للحصول على التعليم خاصةً أن لديها عائلة لتعتني بها',
                            'weight' => 1,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'لا  تعليق. هذا الأمر متعلق بها وبزوجها فقط',
                            'weight' => 2,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => 'أدعم قرارها لأنه من حقها أن تحقق ذاتها وأحلامها',
                            'weight' => 3,
                        ],
                    ],
                ],
                [
                    'id' => 5,
                    'text_ar' => 'قد أطلقت للتو شركتك الناشئة وأنت بحاجة ماسة للموظفين، ما هي استراتيجيتك في التوظيف؟',
                    'options' => [
                        [
                            'id' => 1,
                            'text_ar' => ' أوظف أكبر نسبة من النساء لتحقيق حصة التوظيف والاستفادة من التسهيلات المقدمة من الوزارة',
                            'weight' => 2,
                        ],
                        [
                            'id' => 2,
                            'text_ar' => 'أوظف بحسب الكفاءة وأعمل على تحقيق بيئة عملية متوازنة بين الجنسين',
                            'weight' => 3,
                        ],
                        [
                            'id' => 3,
                            'text_ar' => ' أوظف أكبر نسبة من الرجال، خاصةً الأفراد، لأنهم أكثر تفرغًا',
                            'weight' => 1,
                        ],
                    ],
                ],
            ],
        ],
    ],
    'result_messages' => [
        [
            'min_weight' => 5,
            'title_ar' => 'لَم تطلق العنان لإمكاناتك بعد',
            'description_ar' => 'لنعمل معاً لكسر التحيز وتحقيق المساواة',
        ],
        [
            'min_weight' => 9,
            'title_ar' => 'أنت قادر على إحداث فرق في مجتمعك',
            'description_ar' => 'لأنك على الطريق الصحيح لتحقيق المساواة بين الجنسينن',
        ],
        [
            'min_weight' => 13,
            'title_ar' => 'أنت صانع تغيير في مجتمعك',
            'description_ar' => 'لأنك تحترم المساواة بين الجنسين من دون أي تحيز',
        ],
    ]
];
